# vsoGetCatalogPath

## Description
Get the folder specifier and options path for an object catalog

```pascal
PROCEDURE vsoGetCatalogPath(
				folderSpec   : INTEGER;
				relativePath : STRING);
```

```python

def vs.vsoGetCatalogPath(folderSpec, relativePath):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|folderSpec|INTEGER||
|relativePath|STRING||

## Version
Availability: from Vectorworks 2018
## Category
* Object Events